results/4-nodes/couchbase/workloada_couchbase_custom/log.txt
[OVERALL], RunTime(ms), 120051
[OVERALL], Throughput(ops/sec), 79898.91795986706
[TOTAL_GCS_PS_Scavenge], Count, 225
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1061
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.8837910554680927
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 995
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.8288144205379381
[TOTAL_GCs], Count, 226
[TOTAL_GC_TIME], Time(ms), 2056
[TOTAL_GC_TIME_%], Time(%), 1.7126054760060307
[READ], Operations, 4798367
[READ], AverageLatency(us), 2531.5314762293087
[READ], MinLatency(us), 124
[READ], MaxLatency(us), 8134927
[READ], Return=OK, 4798439
[READ], 0, 5597.639137737962
[READ], 1000, 345.2219674050942
[READ], 2000, 301.6563320845713
[READ], 3000, 307.7691676739769
[READ], 4000, 323.84887801274357
[READ], 5000, 29174.14960449387
[READ], 6000, 2024.3538175774759
[READ], 7000, 2082.9187498734896
[READ], 8000, 2164.475121890236
[READ], 9000, 2337.909996161402
[READ], 10000, 2364.4221433737116
[READ], 11000, 2323.921469740634
[READ], 12000, 2303.4991786538803
[READ], 13000, 2327.2360425285824
[READ], 14000, 2418.9686585679847
[READ], 15000, 2431.021953278919
[READ], 16000, 2287.5001867352094
[READ], 17000, 2291.006659984408
[READ], 18000, 2777.9417066983324
[READ], 19000, 2801.869471587391
[READ], 20000, 2829.664900986065
[READ], 21000, 2794.6605984571443
[READ], 22000, 2717.5875391210584
[READ], 23000, 2770.2173671248115
[READ], 24000, 2614.772158919028
[READ], 25000, 2444.5465176107396
[READ], 26000, 2266.8126984126984
[READ], 27000, 2274.001357654324
[READ], 28000, 2605.5109353421217
[READ], 29000, 2359.3742456108266
[READ], 30000, 2408.907326134912
[READ], 31000, 2421.7525741617774
[READ], 32000, 2215.673200507232
[READ], 33000, 2221.371982238317
[READ], 34000, 2466.6301526717557
[READ], 35000, 2465.701881809178
[READ], 36000, 2363.8282635817172
[READ], 37000, 2308.155644458351
[READ], 38000, 2303.092072175409
[READ], 39000, 2412.0380974640643
[READ], 40000, 2436.279646555553
[READ], 41000, 2302.601964777228
[READ], 42000, 2229.406047935167
[READ], 43000, 2212.47793349118
[READ], 44000, 2613.9031562935734
[READ], 45000, 2881.5009703892647
[READ], 46000, 2774.5079234900395
[READ], 47000, 2725.1598815307475
[READ], 48000, 2744.717605263158
[READ], 49000, 2294.627505630003
[READ], 50000, 2427.923582159078
[READ], 51000, 2336.391573869528
[READ], 52000, 2253.9958355023427
[READ], 53000, 2235.2674839969623
[READ], 54000, 2375.864040459019
[READ], 55000, 2319.273054400787
[READ], 56000, 2377.257914488983
[READ], 57000, 2402.667293582242
[READ], 58000, 2379.391410253464
[READ], 59000, 2327.1049115735605
[READ], 60000, 2347.657493330901
[READ], 61000, 2279.561421723475
[READ], 62000, 2309.998784194529
[READ], 63000, 2383.1263225836196
[READ], 64000, 2352.4649990920648
[READ], 65000, 2554.973065549532
[READ], 66000, 2374.017131067736
[READ], 67000, 2415.4530368863825
[READ], 68000, 2308.202159262215
[READ], 69000, 2319.0871206164493
[READ], 70000, 2341.5598103409347
[READ], 71000, 2565.356607054148
[READ], 72000, 2615.8150576589446
[READ], 73000, 2482.977795934061
[READ], 74000, 2329.189730337079
[READ], 75000, 2469.4303257189185
[READ], 76000, 2378.3930433983505
[READ], 77000, 2300.9271661876433
[READ], 78000, 2281.556029246096
[READ], 79000, 2318.5908766132275
[READ], 80000, 2336.807161113851
[READ], 81000, 2340.418953572071
[READ], 82000, 2266.3151615431507
[READ], 83000, 2539.509473220405
[READ], 84000, 2779.07490395207
[READ], 85000, 2816.6853455273554
[READ], 86000, 2344.133940415964
[READ], 87000, 2325.516109598822
[READ], 88000, 2360.8625868690565
[READ], 89000, 2242.9246387534818
[READ], 90000, 2179.2978508430338
[READ], 91000, 2664.8808518308697
[READ], 92000, 2451.1795585978994
[READ], 93000, 2188.5940503917
[READ], 94000, 2216.791223092185
[READ], 95000, 2875.228197593835
[READ], 96000, 2863.5265042784113
[READ], 97000, 2402.1365324789895
[READ], 98000, 2535.1403767645465
[READ], 99000, 2559.277337047077
[READ], 100000, 2248.029940249394
[READ], 101000, 2317.299306952828
[READ], 102000, 2330.772214592854
[READ], 103000, 2254.9709902431605
[READ], 104000, 2250.891860917701
[READ], 105000, 2312.77832186342
[READ], 106000, 2442.42477089957
[READ], 107000, 2315.968139659324
[READ], 108000, 2784.6391354482316
[READ], 109000, 2838.0616849457083
[READ], 110000, 2885.5423621089863
[READ], 111000, 2834.43793656402
[READ], 112000, 2593.137529720936
[READ], 113000, 2247.420746905954
[READ], 114000, 2314.7966521061794
[CLEANUP], Operations, 210
[CLEANUP], AverageLatency(us), 11.357142857142858
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2221
[CLEANUP], 0, 11.357142857142858
[UPDATE], Operations, 4793452
[UPDATE], AverageLatency(us), 2575.308328110931
[UPDATE], MinLatency(us), 137
[UPDATE], MaxLatency(us), 8182189
[UPDATE], Return=OK, 4793506
[UPDATE], 0, 6768.856135602878
[UPDATE], 1000, 369.3542437196791
[UPDATE], 2000, 333.5291780052697
[UPDATE], 3000, 337.3624478561906
[UPDATE], 4000, 358.6371863430687
[UPDATE], 5000, 26453.673586993857
[UPDATE], 6000, 2073.9602090972926
[UPDATE], 7000, 2155.8339309227185
[UPDATE], 8000, 2233.5280163771818
[UPDATE], 9000, 2392.3323733502652
[UPDATE], 10000, 2395.339306345287
[UPDATE], 11000, 2388.464735036218
[UPDATE], 12000, 2356.3785938578712
[UPDATE], 13000, 2361.9790800620185
[UPDATE], 14000, 2496.8759722711784
[UPDATE], 15000, 2489.347328691657
[UPDATE], 16000, 2327.5939673637026
[UPDATE], 17000, 2375.491061875892
[UPDATE], 18000, 2887.8031689475533
[UPDATE], 19000, 2854.8302218139575
[UPDATE], 20000, 2857.1836100146
[UPDATE], 21000, 2831.5504272117673
[UPDATE], 22000, 2799.99713142797
[UPDATE], 23000, 2808.5773363551525
[UPDATE], 24000, 2671.0652398859247
[UPDATE], 25000, 2473.740247272046
[UPDATE], 26000, 2329.0150734887834
[UPDATE], 27000, 2305.7164286492966
[UPDATE], 28000, 2651.157495683507
[UPDATE], 29000, 2451.099586681975
[UPDATE], 30000, 2465.0042036431573
[UPDATE], 31000, 2502.009373539037
[UPDATE], 32000, 2284.8899779570697
[UPDATE], 33000, 2301.5486497607035
[UPDATE], 34000, 2542.7856154580154
[UPDATE], 35000, 2494.28659100064
[UPDATE], 36000, 2422.0169939143416
[UPDATE], 37000, 2361.1098525230987
[UPDATE], 38000, 2343.0650373931626
[UPDATE], 39000, 2487.246093567797
[UPDATE], 40000, 2496.4784327651514
[UPDATE], 41000, 2366.1690738601014
[UPDATE], 42000, 2306.548603448649
[UPDATE], 43000, 2270.1784679444527
[UPDATE], 44000, 2681.6992621320105
[UPDATE], 45000, 2937.951939924906
[UPDATE], 46000, 2811.611937503344
[UPDATE], 47000, 2696.938729782631
[UPDATE], 48000, 2778.916859486748
[UPDATE], 49000, 2352.13002864067
[UPDATE], 50000, 2444.968472016308
[UPDATE], 51000, 2408.019529566539
[UPDATE], 52000, 2316.8070283060206
[UPDATE], 53000, 2311.790245914093
[UPDATE], 54000, 2394.020817147297
[UPDATE], 55000, 2402.922028526149
[UPDATE], 56000, 2421.8883600173085
[UPDATE], 57000, 2456.84798165775
[UPDATE], 58000, 2448.9871101392564
[UPDATE], 59000, 2391.2770181053197
[UPDATE], 60000, 2408.8548343353073
[UPDATE], 61000, 2340.580794455046
[UPDATE], 62000, 2391.434032279698
[UPDATE], 63000, 2449.565508513576
[UPDATE], 64000, 2422.5362411509477
[UPDATE], 65000, 2620.2517928680945
[UPDATE], 66000, 2437.6599343485
[UPDATE], 67000, 2433.803621944998
[UPDATE], 68000, 2364.376307938911
[UPDATE], 69000, 2392.5872027689124
[UPDATE], 70000, 2387.8624306401407
[UPDATE], 71000, 2625.376832337989
[UPDATE], 72000, 2690.4853044791143
[UPDATE], 73000, 2542.607721787151
[UPDATE], 74000, 2381.1158443081363
[UPDATE], 75000, 2539.516172860105
[UPDATE], 76000, 2448.2375328689395
[UPDATE], 77000, 2379.3905956533404
[UPDATE], 78000, 2339.9378869714137
[UPDATE], 79000, 2374.2048839664817
[UPDATE], 80000, 2379.7054029035244
[UPDATE], 81000, 2384.339204763301
[UPDATE], 82000, 2318.497342761771
[UPDATE], 83000, 2593.7973268470064
[UPDATE], 84000, 2867.211790040377
[UPDATE], 85000, 2900.059058565955
[UPDATE], 86000, 2390.852640893003
[UPDATE], 87000, 2379.6980126467934
[UPDATE], 88000, 2412.3081108038264
[UPDATE], 89000, 2290.8027999656447
[UPDATE], 90000, 2227.1855866812043
[UPDATE], 91000, 2747.6071215539823
[UPDATE], 92000, 2512.3651665443526
[UPDATE], 93000, 2244.840426205296
[UPDATE], 94000, 2264.8695903676407
[UPDATE], 95000, 2948.6282433599954
[UPDATE], 96000, 2896.0556504490605
[UPDATE], 97000, 2462.1588077261567
[UPDATE], 98000, 2604.020657414886
[UPDATE], 99000, 2620.09160753609
[UPDATE], 100000, 2316.108103372755
[UPDATE], 101000, 2376.7880242206775
[UPDATE], 102000, 2381.7126191811553
[UPDATE], 103000, 2313.7815003164765
[UPDATE], 104000, 2305.5081623287224
[UPDATE], 105000, 2334.518213761509
[UPDATE], 106000, 2474.5232763700647
[UPDATE], 107000, 2354.4718811749294
[UPDATE], 108000, 2811.418054924192
[UPDATE], 109000, 2904.679727474211
[UPDATE], 110000, 2898.0841578715917
[UPDATE], 111000, 2890.5126545833446
[UPDATE], 112000, 2641.193423549386
[UPDATE], 113000, 2306.3891134698115
[UPDATE], 114000, 2365.0976932267254